# HostId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationHostedInfo..::..HostId Property
FabricationHostedInfo Class See Also
---
Returns the identifier of the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId HostId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostId {
	ElementId^ get ();
}
```

# See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace